uyencorki/uvc-ai-stm32/Src/app.c
 /**
 ******************************************************************************
 * @file    app.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "app.h"

#include <stdint.h>

#include "app_cam.h"
#include "app_config.h"
#include "app_postprocess.h"
#include "isp_api.h"
#include "cmw_camera.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_ll_venc.h"
#include "stm32n6570_discovery.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "app_enc.h"
#include "utils.h"
#include "uvcl.h"
#include "draw.h"
#include "stai.h"
#include "stai_network.h"

#include "figs.h"

#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "dev"
#endif

#define FREERTOS_PRIORITY(p) ((UBaseType_t)((int)tskIDLE_PRIORITY + configMAX_PRIORITIES / 2 + (p)))

#define CACHE_OP(__op__) do { \
  if (is_cache_enable()) { \
    __op__; \
  } \
} while (0)

#define ALIGN_VALUE(_v_,_a_) (((_v_) + (_a_) - 1) & ~((_a_) - 1))

#define DBG_INFO_FONT font_12
#define CONF_LEVEL_FONT font_16
#define INF_INFO_FONT font_16
#define OBJ_RECT_COLOR 0xffffffff

#define BQUEUE_MAX_BUFFERS 2
#define CPU_LOAD_HISTORY_DEPTH 8

#define CAPTURE_BUFFER_NB (CAPTURE_DELAY + 2)

static int BOARD_PinIsAf(GPIO_TypeDef *port, uint32_t pin_index, uint32_t af)
{
  uint32_t mode = (port->MODER >> (pin_index * 2U)) & 0x3U;
  uint32_t afr = (pin_index < 8U) ?
                 ((port->AFR[0] >> (pin_index * 4U)) & 0xFU) :
                 ((port->AFR[1] >> ((pin_index - 8U) * 4U)) & 0xFU);

  return (mode == 0x2U) && (afr == af);
}

static int BOARD_PinIsOutput(GPIO_TypeDef *port, uint32_t pin_index)
{
  uint32_t mode = (port->MODER >> (pin_index * 2U)) & 0x3U;
  return (mode == 0x1U);
}

void BOARD_Pins_Init_DCMIPP(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  int iomux_ok = 1;

  printf("[IOMUX] PX9210K DVP pinmux start\r\n");

  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPION_CLK_ENABLE();

  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  /* PB6/PB7/PB8/PB9 => D6/D7/VSYNC/D3 */
  GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9;
  GPIO_InitStruct.Alternate = GPIO_AF9_DCMIPP;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* PC6 => D1 */
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /* PE0/PE8 => D2/D4 */
  GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_8;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /* PN9 => D5 */
  GPIO_InitStruct.Pin = GPIO_PIN_9;
  HAL_GPIO_Init(GPION, &GPIO_InitStruct);

  /* PD0/PD5/PD7 => HSYNC/PIXCLK/D0 */
  GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_5 | GPIO_PIN_7;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* PC8 => RESET_N (keep de-asserted) */
  GPIO_InitStruct.Pin = GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = 0U;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);

  iomux_ok &= BOARD_PinIsAf(GPIOB, 6U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOB, 7U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOB, 8U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOB, 9U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOC, 6U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOE, 0U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOE, 8U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPION, 9U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOD, 0U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOD, 5U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsAf(GPIOD, 7U, GPIO_AF9_DCMIPP);
  iomux_ok &= BOARD_PinIsOutput(GPIOC, 8U);

  if (iomux_ok != 0)
  {
    printf("[IOMUX] PX9210K DVP/RESET pinmux OK\r\n");
  }
  else
  {
    printf("[IOMUX] PX9210K pinmux verify FAILED\r\n");
    assert(0);
  }

  printf("[IOMUX] DVP: PD7(D0) PC6(D1) PE0(D2) PB9(D3) PE8(D4) PN9(D5) PB6(D6) PB7(D7) PD5(PIXCLK) PD0(HSYNC) PB8(VSYNC)\r\n");
  printf("[IOMUX] CTRL: PC8(RESET_N), I2C1(PH9/PC1) owned by BSP\r\n");
}

/* venc conf */
#define VENC_MAX_WIDTH 1280
#define VENC_MAX_HEIGHT 720
#define VENC_OUT_BUFFER_SIZE (255 * 1024)

/* Model Related Info */
#define NN_BUFFER_OUT_SIZE STAI_NETWORK_OUT_1_SIZE_BYTES

/* Align so we are sure nn_output_buffers[0] and nn_output_buffers[1] are aligned on STAI_NETWORK_OUT_1_ALIGNMENT bytes */
#define NN_BUFFER_OUT_SIZE_ALIGN ALIGN_VALUE(NN_BUFFER_OUT_SIZE, STAI_NETWORK_OUT_1_ALIGNMENT)

typedef struct {
  int last;
  int total;
  uint64_t acc;
  float mean;
} time_stat_t;

typedef struct {
  time_stat_t nn_total_time;
  time_stat_t nn_inference_time;
  time_stat_t disp_total_time;
  time_stat_t nn_pp_time;
  time_stat_t disp_display_time;
  time_stat_t disp_enc_time;
} stat_info_t;

typedef struct {
  float conf;
  int16_t x;
  int16_t y;
  int16_t w;
  int16_t h;
} box_t;

typedef struct {
  SemaphoreHandle_t free;
  StaticSemaphore_t free_buffer;
  SemaphoreHandle_t ready;
  StaticSemaphore_t ready_buffer;
  int buffer_nb;
  uint8_t *buffers[BQUEUE_MAX_BUFFERS];
  int free_idx;
  int ready_idx;
} bqueue_t;

typedef struct {
  uint64_t current_total;
  uint64_t current_thread_total;
  uint64_t prev_total;
  uint64_t prev_thread_total;
  struct {
    uint64_t total;
    uint64_t thread;
    uint32_t tick;
  } history[CPU_LOAD_HISTORY_DEPTH];
} cpuload_info_t;

/* Globals */
/* display */
static DRAW_Font_t font_12;
static DRAW_Font_t font_16;
static SemaphoreHandle_t stat_info_lock;
static StaticSemaphore_t stat_info_lock_buffer;
static stat_info_t stat_info;
static cpuload_info_t cpu_load;
static int g_pipe1_first_frame_logged;
static int g_pipe2_first_frame_logged;
static int g_pipe1_first_vsync_logged;
static uint32_t g_pipe1_frame_irq_count;
static uint32_t g_pipe2_frame_irq_count;
static uint32_t g_pipe1_vsync_irq_count;
static uint32_t g_pipe_error_irq_count[3];
static uint32_t g_cam_health_last_ms;
static uint32_t g_cam_health_last_pipe1_frame;
static uint32_t g_cam_health_last_pipe2_frame;
static uint32_t g_cam_health_last_pipe1_vsync;
static uint32_t g_cam_health_last_pipe_err[3];
static uint32_t g_pipe1_rearm_ok_count;
static uint32_t g_pipe1_rearm_fail_count;
static uint32_t g_pipe1_last_frame_hash;
static uint32_t g_pipe1_last_head_hash;
static uint32_t g_pipe1_stable_seconds;
static int g_pipe1_first_frame_pending_log;
static int g_pipe2_first_frame_pending_log;
static int g_pipe1_first_vsync_pending_log;
static int g_pipe1_first_rearm_ok_pending_log;
static int g_pipe1_rearm_fail_pending_log;
static int g_pipe1_rearm_fail_last_ret;
static uint32_t g_pipe1_rearm_fail_last_state;
static int g_pipe1_rearm_fail_last_disp_idx;
static int g_pipe1_rearm_fail_last_capt_idx;
static int g_pipe1_rearm_fail_last_next_idx;
static int g_pipe1_first_rearm_ok_next_idx;
static uint32_t g_pipe1_first_rearm_ok_addr;
static int g_pipe1_first_dump_done;
static uint8_t g_pipe1_first16_snapshot[16];
static uint8_t g_pipe1_first64_snapshot[64];
static int g_pipe1_first16_snapshot_ready;
static volatile int g_pipe1_snapshot_pending;
static volatile int g_pipe1_snapshot_idx;

/* Forward declarations: used by early debug dump helper before full definitions below. */
static uint8_t capture_buffer[CAPTURE_BUFFER_NB][VENC_MAX_WIDTH * VENC_MAX_HEIGHT * CAPTURE_BPP];
static int capture_buffer_disp_idx;
static int is_cache_enable(void);
static uint32_t app_frame_sample_hash(const uint8_t *fb, uint32_t frame_bytes);
static void app_log_pipe1_data_1s(uint32_t frame_delta);

static void app_capture_pipe1_snapshot_once(uint8_t *src)
{
  int i;

  if ((g_pipe1_first16_snapshot_ready != 0) || (src == NULL))
  {
    return;
  }

  CACHE_OP(SCB_InvalidateDCache_by_Addr(src, 64));

