uyencorki/uvc-ai-stm32/Src/app.c
static void app_uvc_frame_release(struct uvcl_callbacks *cbs, void *frame)
{
  assert(buffer_flying);

  buffer_flying = 0;
}

static void app_display_info_header()
{
  printf("========================================\n\r");
  printf("x-cube-n6-ai-h264-usb-uvc v2.2.0--- hinoeng app 09:13 (%s)\n\r", APP_VERSION_STRING);
  printf("Build date & time: %s %s\n\r", __DATE__, __TIME__);
#if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n\r", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\r\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n\r");
#endif
  printf("HAL: %lu.%lu.%lu\n\r", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n\r", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n\r", STAI_NETWORK_ORIGIN_MODEL_NAME);
  printf("========================================\n\r");
}

void app_run()
{
  UBaseType_t isp_priority = FREERTOS_PRIORITY(2);
#if !APP_DVP_BRINGUP_PIPE1_ONLY
  UBaseType_t dp_priority = FREERTOS_PRIORITY(-2);
  UBaseType_t nn_priority = FREERTOS_PRIORITY(1);
#endif
  UVCL_Conf_t uvcl_conf = { 0 };
  ENC_Conf_t enc_conf = { 0 };
  TaskHandle_t hdl;
  int ret;

  app_display_info_header();
    printf("[APP] cfg sensor=%dx%d venc=%dx%d pipe1_only=%d\r\n",
      SENSOR_DVP_WIDTH,
      SENSOR_DVP_HEIGHT,
      VENC_DVP_WIDTH,
      VENC_DVP_HEIGHT,
      APP_DVP_BRINGUP_PIPE1_ONLY);
    printf("[APP] buf capture0=0x%08lX captureN=%d nn_in0=0x%08lX nn_out0=0x%08lX\r\n",
      (unsigned long)capture_buffer[0],
      CAPTURE_BUFFER_NB,
      (unsigned long)nn_input_buffers[0],
      (unsigned long)nn_output_buffers[0]);
  /* Enable DWT so DWT_CYCCNT works when debugger not attached */
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

  ret = BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
  assert(ret == BSP_ERROR_NONE);

  cpuload_init(&cpu_load);

  /* create buffer queues */
  ret = bqueue_init(&nn_input_queue, 2, (uint8_t *[2]){nn_input_buffers[0], nn_input_buffers[1]});
  assert(ret == 0);
  ret = bqueue_init(&nn_output_queue, 2, (uint8_t *[2]){nn_output_buffers[0], nn_output_buffers[1]});
  assert(ret == 0);

  /* setup fonts */
  ret = DRAW_FontSetup(&Font12, &font_12);
  assert(ret == 0);
  ret = DRAW_FontSetup(&Font16, &font_16);
  assert(ret == 0);

  /* Enable venc */
  __HAL_RCC_SYSCFG_CLK_ENABLE();
   LL_VENC_Init();

  /*** Camera Init ************************************************************/  
  CAM_Init();

  /* Encoder init */
  enc_conf.width = VENC_WIDTH;
  enc_conf.height = VENC_HEIGHT;
  enc_conf.fps = CAMERA_FPS;
  ENC_Init(&enc_conf);

  /* Uvc init */
  uvcl_conf.streams[0].width = VENC_WIDTH;
  uvcl_conf.streams[0].height = VENC_HEIGHT;
  uvcl_conf.streams[0].fps = CAMERA_FPS;
  uvcl_conf.streams[0].payload_type = UVCL_PAYLOAD_FB_H264;
  uvcl_conf.streams_nb = 1;
  uvcl_conf.is_immediate_mode = 1;
  uvcl_cbs.streaming_active = app_uvc_streaming_active;
  uvcl_cbs.streaming_inactive = app_uvc_streaming_inactive;
  uvcl_cbs.frame_release = app_uvc_frame_release;
  ret = UVCL_Init(USB1_OTG_HS, &uvcl_conf, &uvcl_cbs);
  if (ret == 0)
  {
    printf("[UVC] UVCL_Init OK (USB1_OTG_HS)\r\n");
  }
  else
  {
    printf("[UVC][ERR] UVCL_Init failed ret=%d\r\n", ret);
  }

  /* sems + mutex init */
  isp_sem = xSemaphoreCreateCountingStatic(1, 0, &isp_sem_buffer);
  assert(isp_sem);
  dma2d_sem = xSemaphoreCreateCountingStatic(1, 0, &dma2d_sem_buffer);
  assert(dma2d_sem);
  dma2d_lock = xSemaphoreCreateMutexStatic(&dma2d_lock_buffer);
  assert(dma2d_lock);
  stat_info_lock = xSemaphoreCreateMutexStatic(&stat_info_lock_buffer);
  assert(stat_info_lock);

  /* Start LCD Display camera pipe stream */
  CAM_DisplayPipe_Start(capture_buffer[0], CMW_MODE_CONTINUOUS);

  /* threads init */
#if APP_DVP_BRINGUP_PIPE1_ONLY
  printf("[CAM] bring-up mode enabled: NN/PIPE2 and DP threads are skipped\r\n");
#else
  hdl = xTaskCreateStatic(nn_thread_fct, "nn", configMINIMAL_STACK_SIZE * 2, NULL, nn_priority, nn_thread_stack,
                          &nn_thread);
  assert(hdl != NULL);
  hdl = xTaskCreateStatic(dp_thread_fct, "dp", configMINIMAL_STACK_SIZE * 2, NULL, dp_priority, dp_thread_stack,
                          &dp_thread);
  assert(hdl != NULL);
#endif
  hdl = xTaskCreateStatic(isp_thread_fct, "isp", configMINIMAL_STACK_SIZE * 2, NULL, isp_priority, isp_thread_stack,
                          &isp_thread);
  assert(hdl != NULL);

}

int CMW_CAMERA_PIPE_FrameEventCallback(uint32_t pipe)
{
  /* Keep ISR callback minimal to avoid capture instability during bring-up. */
  if (pipe == DCMIPP_PIPE1)
  {
    g_pipe1_frame_irq_count++;
    if (g_pipe1_first_frame_logged == 0)
    {
      g_pipe1_first_frame_logged = 1;
      g_pipe1_first_frame_pending_log = 1;
      g_pipe1_snapshot_idx = capture_buffer_capt_idx;
      g_pipe1_snapshot_pending = 1;
    }
    (void)app_main_pipe_frame_event();
  }
  else if (pipe == DCMIPP_PIPE2)
  {
    g_pipe2_frame_irq_count++;
    if (g_pipe2_first_frame_logged == 0)
    {
      g_pipe2_first_frame_logged = 1;
      g_pipe2_first_frame_pending_log = 1;
    }
    app_ancillary_pipe_frame_event();
  }

  return HAL_OK;
}

int CMW_CAMERA_PIPE_VsyncEventCallback(uint32_t pipe)
{
  if ((pipe == DCMIPP_PIPE1) && (g_pipe1_first_vsync_logged == 0))
  {
    g_pipe1_first_vsync_logged = 1;
    g_pipe1_first_vsync_pending_log = 1;
  }

  if (pipe == DCMIPP_PIPE1)
  {
    g_pipe1_vsync_irq_count++;
  }

  if (pipe == DCMIPP_PIPE1)
    app_main_pipe_vsync_event();

  return HAL_OK;
}

void DRAW_HwLock(void *dma2d_handle)
{
  int ret;

  ret = xSemaphoreTake(dma2d_lock, portMAX_DELAY);
  assert(ret == pdTRUE);

  dma2d_current = dma2d_handle;
}

void DRAW_HwUnlock()
{
  int ret;

  ret = xSemaphoreGive(dma2d_lock);
  assert(ret == pdTRUE);
}

void DRAW_Wfe()
{
  int ret;

  ret = xSemaphoreTake(dma2d_sem, portMAX_DELAY);
  assert(ret == pdTRUE);
}

void DRAW_Signal()
{
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  int ret;

  ret = xSemaphoreGiveFromISR(dma2d_sem, &xHigherPriorityTaskWoken);
  assert(ret == pdTRUE);

  portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void DMA2D_IRQHandler(void)
{
  HAL_DMA2D_IRQHandler(dma2d_current);
}
